experiments/results/baseline-jaeger/raw/20260623_223950_compose-post_R500_t4_c40_d60.txt
# workload=compose-post
# rate=500
# threads=4
# connections=40
# duration=60
# timestamp=20260623_223950

Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  4 threads and 40 connections

  Thread calibration: mean lat.: 4.824ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.877ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.903ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.911ms, rate sampling interval: 12ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.92ms    0.99ms   7.55ms   79.71%
    Req/Sec   129.79    105.92   416.00     58.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.68ms
 75.000%    4.33ms
 90.000%    5.10ms
 99.000%    7.55ms
 99.900%   10.19ms
 99.990%   14.29ms
 99.999%   15.77ms
100.000%   15.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.361     0.000000            1         1.00
       2.973     0.100000         2498         1.11
       3.165     0.200000         5010         1.25
       3.335     0.300000         7505         1.43
       3.507     0.400000         9986         1.67
       3.683     0.500000        12506         2.00
       3.787     0.550000        13746         2.22
       3.897     0.600000        14998         2.50
       4.019     0.650000        16239         2.86
       4.159     0.700000        17513         3.33
       4.327     0.750000        18738         4.00
       4.419     0.775000        19377         4.44
       4.519     0.800000        19984         5.00
       4.631     0.825000        20602         5.71
       4.759     0.850000        21222         6.67
       4.903     0.875000        21851         8.00
       4.999     0.887500        22163         8.89
       5.103     0.900000        22478        10.00
       5.219     0.912500        22794        11.43
       5.359     0.925000        23104        13.33
       5.523     0.937500        23408        16.00
       5.639     0.943750        23564        17.78
       5.771     0.950000        23721        20.00
       5.895     0.956250        23873        22.86
       6.043     0.962500        24030        26.67
       6.255     0.968750        24185        32.00
       6.391     0.971875        24264        35.56
       6.523     0.975000        24341        40.00
       6.643     0.978125        24419        45.71
       6.843     0.981250        24497        53.33
       7.047     0.984375        24577        64.00
       7.187     0.985938        24615        71.11
       7.351     0.987500        24653        80.00
       7.495     0.989062        24692        91.43
       7.671     0.990625        24732       106.67
       7.923     0.992188        24770       128.00
       8.035     0.992969        24790       142.22
       8.175     0.993750        24809       160.00
       8.335     0.994531        24831       182.86
       8.495     0.995313        24850       213.33
       8.687     0.996094        24868       256.00
       8.807     0.996484        24878       284.44
       8.903     0.996875        24887       320.00
       8.983     0.997266        24897       365.71
       9.175     0.997656        24907       426.67
       9.367     0.998047        24917       512.00
       9.463     0.998242        24922       568.89
       9.647     0.998437        24926       640.00
       9.935     0.998633        24931       731.43
      10.095     0.998828        24936       853.33
      10.199     0.999023        24941      1024.00
      10.319     0.999121        24944      1137.78
      10.527     0.999219        24946      1280.00
      10.583     0.999316        24948      1462.86
      10.871     0.999414        24951      1706.67
      10.967     0.999512        24953      2048.00
      11.119     0.999561        24955      2275.56
      11.127     0.999609        24956      2560.00
      11.143     0.999658        24958      2925.71
      11.143     0.999707        24958      3413.33
      11.423     0.999756        24959      4096.00
      11.607     0.999780        24960      4551.11
      12.655     0.999805        24961      5120.00
      12.655     0.999829        24961      5851.43
      13.391     0.999854        24962      6826.67
      13.391     0.999878        24962      8192.00
      14.287     0.999890        24963      9102.22
      14.287     0.999902        24963     10240.00
      14.287     0.999915        24963     11702.86
      14.479     0.999927        24964     13653.33
      14.479     0.999939        24964     16384.00
      14.479     0.999945        24964     18204.44
      14.479     0.999951        24964     20480.00
      14.479     0.999957        24964     23405.71
      15.767     0.999963        24965     27306.67
      15.767     1.000000        24965          inf
#[Mean    =        3.921, StdDeviation   =        0.993]
#[Max     =       15.760, Total count    =        24965]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29949 requests in 1.00m, 6.14MB read
Requests/sec:    499.07  
Transfer/sec:    104.78KB

# docker compose ps
NAME                                     IMAGE                                                COMMAND                  SERVICE                  CREATED        STATUS             PORTS
socialnetwork-compose-post-service-1     deathstarbench/social-network-microservices:latest   "ComposePostService"     compose-post-service     11 hours ago   Up About an hour   
socialnetwork-home-timeline-redis-1      redis                                                "docker-entrypoint.s…"   home-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-home-timeline-service-1    deathstarbench/social-network-microservices:latest   "HomeTimelineService"    home-timeline-service    11 hours ago   Up About an hour   
socialnetwork-jaeger-agent-1             jaegertracing/all-in-one:1.62.0                      "/go/bin/all-in-one-…"   jaeger-agent             11 hours ago   Up About an hour   4317-4318/tcp, 5775/udp, 5778/tcp, 9411/tcp, 14250/tcp, 14268/tcp, 6831-6832/udp, 0.0.0.0:16686->16686/tcp, [::]:16686->16686/tcp
socialnetwork-media-frontend-1           yg397/media-frontend:xenial                          "/usr/local/openrest…"   media-frontend           11 hours ago   Up About an hour   0.0.0.0:8081->8080/tcp, [::]:8081->8080/tcp
socialnetwork-media-memcached-1          memcached                                            "docker-entrypoint.s…"   media-memcached          11 hours ago   Up About an hour   11211/tcp
socialnetwork-media-mongodb-1            mongo:4.4.6                                          "docker-entrypoint.s…"   media-mongodb            11 hours ago   Up About an hour   27017/tcp
socialnetwork-media-service-1            deathstarbench/social-network-microservices:latest   "MediaService"           media-service            11 hours ago   Up About an hour   
socialnetwork-nginx-thrift-1             yg397/openresty-thrift:xenial                        "/usr/local/openrest…"   nginx-thrift             11 hours ago   Up About an hour   0.0.0.0:8080->8080/tcp, [::]:8080->8080/tcp
socialnetwork-post-storage-memcached-1   memcached                                            "docker-entrypoint.s…"   post-storage-memcached   11 hours ago   Up About an hour   11211/tcp
socialnetwork-post-storage-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   post-storage-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-post-storage-service-1     deathstarbench/social-network-microservices:latest   "PostStorageService"     post-storage-service     11 hours ago   Up About an hour   0.0.0.0:10002->9090/tcp, [::]:10002->9090/tcp
socialnetwork-social-graph-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   social-graph-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-social-graph-redis-1       redis                                                "docker-entrypoint.s…"   social-graph-redis       11 hours ago   Up About an hour   6379/tcp
socialnetwork-social-graph-service-1     deathstarbench/social-network-microservices:latest   "SocialGraphService"     social-graph-service     11 hours ago   Up About an hour   
socialnetwork-text-service-1             deathstarbench/social-network-microservices:latest   "TextService"            text-service             11 hours ago   Up About an hour   
socialnetwork-unique-id-service-1        deathstarbench/social-network-microservices:latest   "UniqueIdService"        unique-id-service        11 hours ago   Up About an hour   
socialnetwork-url-shorten-memcached-1    memcached                                            "docker-entrypoint.s…"   url-shorten-memcached    11 hours ago   Up About an hour   11211/tcp
socialnetwork-url-shorten-mongodb-1      mongo:4.4.6                                          "docker-entrypoint.s…"   url-shorten-mongodb      11 hours ago   Up About an hour   27017/tcp
socialnetwork-url-shorten-service-1      deathstarbench/social-network-microservices:latest   "UrlShortenService"      url-shorten-service      11 hours ago   Up About an hour   
socialnetwork-user-memcached-1           memcached                                            "docker-entrypoint.s…"   user-memcached           11 hours ago   Up About an hour   11211/tcp
socialnetwork-user-mention-service-1     deathstarbench/social-network-microservices:latest   "UserMentionService"     user-mention-service     11 hours ago   Up About an hour   
socialnetwork-user-mongodb-1             mongo:4.4.6                                          "docker-entrypoint.s…"   user-mongodb             11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-service-1             deathstarbench/social-network-microservices:latest   "UserService"            user-service             11 hours ago   Up About an hour   
socialnetwork-user-timeline-mongodb-1    mongo:4.4.6                                          "docker-entrypoint.s…"   user-timeline-mongodb    11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-timeline-redis-1      redis                                                "docker-entrypoint.s…"   user-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-user-timeline-service-1    deathstarbench/social-network-microservices:latest   "UserTimelineService"    user-timeline-service    11 hours ago   Up About an hour